In [9]:
import os
import pandas as pd
import seaborn as sns
from helper import WorkingPath

In [7]:
wpath = WorkingPath()

In [11]:
file_name = 'titanic.csv'
titanic_file = os.path.join(wpath.preparation_path(), 'titanic.csv')
titanic_df = pd.read_csv(titanic_file)

In [13]:
# check the column name
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

### Columns definition 
- survival - Survival (0 = No; 1 = Yes)
- class - Passenger Class (1 = 1st; 2 = 2nd; 3 = 3rd)
- name - Name
- sex - Sex
- age - Age
- sibsp - Number of Siblings/Spouses Aboard
- parch - Number of Parents/Children Aboard
- ticket - Ticket Number
- fare - Passenger Fare
- cabin - Cabin
- embarked - Port of Embarkation (C = Cherbourg; Q = Queenstown; S = Southampton)
- boat - Lifeboat (if survived)
- body - Body number (if did not survive and body was recovered)

https://github.com/awesomedata/awesome-public-datasets/issues/351

In [14]:
titanic_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
# Find the number of null in dataframe
titanic_df.isnull().any()

PassengerId    False
Survived       False
Pclass         False
Name           False
Sex            False
Age             True
SibSp          False
Parch          False
Ticket         False
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [19]:
# select the required columns to analysis
sel_cols = ['PassengerId', 'Pclass', 'Sex', 'Age', 'Survived']

In [20]:
titanic_df_mod = titanic_df[sel_cols]

In [21]:
titanic_df_mod

     PassengerId  Pclass     Sex   Age  Survived
0              1       3    male  22.0         0
1              2       1  female  38.0         1
2              3       3  female  26.0         1
3              4       1  female  35.0         1
4              5       3    male  35.0         0
..           ...     ...     ...   ...       ...
886          887       2    male  27.0         0
887          888       1  female  19.0         1
888          889       3  female   NaN         0
889          890       1    male  26.0         1
890          891       3    male  32.0         0

[891 rows x 5 columns]

In [22]:
# classified based on class 
first_df = titanic_df_mod.loc[titanic_df_mod['Pclass']==1]
second_df = titanic_df_mod.loc[titanic_df_mod['Pclass']==2]
third_df = titanic_df_mod.loc[titanic_df_mod['Pclass']==3]

In [23]:
first_df.shape[0]

216

In [24]:
second_df.shape[0]

184

In [25]:
third_df.shape[0]

491